## Plan Result (ithc_appgateway - TerraformPlanApply)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_application_gateway.ag[0]
  * module.appgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw"
        name                              = "aks-fe-00-ithc-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "ithc"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "c100-application.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/c100-application" -> null
          - name                           = "c100-application" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "darts.ithc.apps.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/darts-portal" -> null
          - name                           = "darts-portal" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "juror-public.ithc.apps.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/juror-public" -> null
          - name                           = "juror-public" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "juror.ithc.apps.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/juror-bureau" -> null
          - name                           = "juror-bureau" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "pip-frontend.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/pip-frontend" -> null
          - name                           = "pip-frontend" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "sds-api-mgmt.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/sds-api-mgmt" -> null
          - name                           = "sds-api-mgmt" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "sign-in.pip-frontend.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/pip-frontend-b2c-sign-in" -> null
          - name                           = "pip-frontend-b2c-sign-in" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "staff.pip-frontend.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/pip-frontend-b2c-staff" -> null
          - name                           = "pip-frontend-b2c-staff" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "toffee.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/toffee" -> null
          - name                           = "toffee" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "vh-admin-web.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/vh-admin-web" -> null
          - name                           = "vh-admin-web" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "vh-service-web.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/vh-service-web" -> null
          - name                           = "vh-service-web" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "vh-test-web.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/vh-test-web" -> null
          - name                           = "vh-test-web" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "vh-video-web.ithc.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/httpListeners/vh-video-web" -> null
          - name                           = "vh-video-web" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
            # (5 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "c100-application.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "c100-application"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "darts.ithc.apps.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "darts-portal"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "juror-public.ithc.apps.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "juror-public"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "juror.ithc.apps.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "juror-bureau"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "pip-frontend.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "pip-frontend"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "sds-api-mgmt.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "sds-api-mgmt"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "sign-in.pip-frontend.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "pip-frontend-b2c-sign-in"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "staff.pip-frontend.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "pip-frontend-b2c-staff"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "toffee.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "toffee"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "vh-admin-web.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-admin-web"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "vh-service-web.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-service-web"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "vh-test-web.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-test-web"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_name                      = "vh-video-web.ithc.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-video-web"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-ithc-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
            # (2 unchanged attributes hidden)
        }

      - probe {
          - host                                      = "c100-application.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/c100-application" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "c100-application" -> null
          - path                                      = "/status" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "darts.ithc.apps.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/darts-portal" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "darts-portal" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "juror-public.ithc.apps.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/juror-public" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "juror-public" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "juror.ithc.apps.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/juror-bureau" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "juror-bureau" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "pip-frontend.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/pip-frontend" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "pip-frontend" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "sds-api-mgmt.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/sds-api-mgmt" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "sds-api-mgmt" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "sign-in.pip-frontend.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/pip-frontend-b2c-sign-in" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "pip-frontend-b2c-sign-in" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "staff.pip-frontend.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/pip-frontend-b2c-staff" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "pip-frontend-b2c-staff" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "toffee.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/toffee" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "toffee" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "vh-admin-web.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/vh-admin-web" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "vh-admin-web" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "vh-service-web.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/vh-service-web" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "vh-service-web" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "vh-test-web.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/vh-test-web" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "vh-test-web" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - host                                      = "vh-video-web.ithc.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw/probes/vh-video-web" -> null
          - interval                                  = 20 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "vh-video-web" -> null
          - path                                      = "/health/liveness" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "c100-application"
          + path                                      = "/status"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "darts-portal"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "juror-bureau"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "juror-public"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "pip-frontend"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "pip-frontend-b2c-sign-in"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "pip-frontend-b2c-staff"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "sds-api-mgmt"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "toffee"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "vh-admin-web"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "vh-service-web"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "vh-test-web"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "app.custom_domain"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "vh-video-web"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

        # (47 unchanged blocks hidden)
    }

  # module.appgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-ithc-agw|app-gw-storage-account"
        name                           = "app-gw-storage-account"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":894,"Program":"tfcmt","SHA1":"","Target":"ithc_appgateway - TerraformPlanApply","Vars":{}} -->